" Well, I've bunch of fucking assholes. You know why? You don't have the guts to be what you want to be. You need people like me. You need people like me so you can point your fucking fingers. I say that's the bad guy. I think the Lord from my many blessings No stress to keep a vest for protection From the battle of a spith and wester And all my niggas in the pain Here we go again. Ain't no separateness but my max is important And together with the hustler, older, straight soldier Bucking at the bus does no matter how you try niggas never die We just retaliate with hate and we multiply See me strike a down the block, King Kongers Rubber like a motherfucker lipping like a whore Halo stopping at the rail lights I'm sideways to our lives, motherfucker Come on, pace, let the cops put their lights on Jakes me niggas zigzagging through the freeway Race me niggas in the house, be chased with the law The realest motherfucker that you ever saw Sick of pie to the black god, everybody got a pie Well, I'm bunch of fucking ass Sick of pie to the black god, everybody got a pie You don't have that much to be what you want to be Sick of pie to the black god, everybody got a pie Sick of pie to the black god, so you can point your fucking fingers I say that's the bad guy Ain't no escape from a deadly fate And every day there's a million black bodies put away I'm starting to lose hope, it seems everybody's on dope Mama told me to leave cause she was broke Sometimes I choke on the end, though creeping up the window Alone on my own, I'm a criminal Got no love from my household I'm out cold on the street screaming, motherfucker, peace I got nothing to do with my mother It's nothing to prove, I do what I do Let it thug life make it stature I wonder when they kill me Yeah, every four real jeep, no, forgive me if you feel me Cause all my life I was turned pro With no hope, no skinny, motherfucker, one dope I hate to cut some of those from my ways of blame But everyday it's a struggle to can make you pay Sick of pie to the black god, everybody got a pie Well, I'm bunch of fucking ass Sick of pie to the black god, everybody got a pie You don't have that much to be what you want to be Sick of pie to the black god, everybody got a pie Sick of pie to the black god, everybody got a pie Sick of pie to the black god, everybody got a pie Sick of pie to the black god, everybody got a pie Sick of pie to the black god, everybody got a pie Show you can point your fucking fingers, and say that's the black god The only way to change me is me and me and me and me and my brains I'll stuck in the middle of the game to get the pain out Pray to my god everyday, but he don't listen The poverty bothers me, my mama's walking with us In the kitchen, listen, I can hear what crying in the bedroom Pray for money, what never, give what she would be doing J me my mom, for wishing I was somewhere rough I can't feed my friend, can I play daddy Cause he left me, wish he would have hooked me too much like him So my mama don't love me on my own at the early age I'm getting paid in the shrubs, so I never be afraid But till I go astray, I'm hanging in the back streets Running with Jesus and dope things, but they jack me, can't turn back My eyes on the bars, I got nothing to lose I got nothing second-byte of the black god, everybody got a pie Well I'm a bunch of fucking ass I'm a bunch of fucking psychobotter, the black god, everybody got a pie You all have to be what you want to be I'm a bunch of fucking psychobotter, the black god, everybody got a pie I'm a bunch of fucking psychobotter, the black god, so you can point your fucking fingers And say that's the bad guy So I'll say good night to the black god You know what the fuck this is? You in the mix of my own boy, DDJ me mo Last time you're gonna see a bad guy like this again on the tape You know what the fuck this is?"